docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-06-12 Fri 21:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>dotDOOM</title>
<meta name="author" content="Rohit Goswami" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://thomasf.github.io/solarized-css/solarized-dark.min.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://rgoswami.me"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">dotDOOM</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc6e7c5c">1. What?</a>
<ul>
<li><a href="#org5679fe3">1.1. Configuration</a></li>
<li><a href="#orgde93b6c">1.2. Packages</a></li>
</ul>
</li>
<li><a href="#org6308a4b">2. Why?</a>
<ul>
<li><a href="#org6b5ac45">2.1. Who?</a></li>
</ul>
</li>
<li><a href="#org79f9114">3. How?</a></li>
<li><a href="#org3d4b0a0">4. Maintenance</a></li>
<li><a href="#org1f83550">5. Config</a></li>
<li><a href="#orga2893bd">6. License</a></li>
</ul>
</div>
</div>
<p>
This looks better <a href="https://dotdoom.rgoswami.me">on the website</a>.
</p>
<div id="outline-container-orgc6e7c5c" class="outline-2">
<h2 id="orgc6e7c5c"><span class="section-number-2">1.</span> What?</h2>
<div class="outline-text-2" id="text-1">
<p>
This is actually a <a href="https://github.com/hlissner/doom-emacs">doom-emacs</a> private module. I was feeling rather whimsical.
</p>
</div>
<div id="outline-container-org5679fe3" class="outline-3">
<h3 id="org5679fe3"><span class="section-number-3">1.1.</span> Configuration</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This is <a href="config.html">documented here</a>.
</p>
</div>
</div>
<div id="outline-container-orgde93b6c" class="outline-3">
<h3 id="orgde93b6c"><span class="section-number-3">1.2.</span> Packages</h3>
<div class="outline-text-3" id="text-1-2">
<p>
I also document the packages I use in a <a href="packages.html">separately here</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-org6308a4b" class="outline-2">
<h2 id="org6308a4b"><span class="section-number-2">2.</span> Why?</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://github.com/HaoZeke/Dotfiles">My Dotfiles repo</a>, managed with the brilliant <a href="https://github.com/kobus-v-schoor/dotgit">dotgit</a>, was getting rather overwhelmed
with <code>emacs</code> commits. Also managing snippets with <code>dotgit</code> was not exactly
pleasant, since each symlink needed to be listed in the <code>filelist</code>.
</p>
</div>
<div id="outline-container-org6b5ac45" class="outline-3">
<h3 id="org6b5ac45"><span class="section-number-3">2.1.</span> Who?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
I'm <a href="https://orcid.org/0000-0002-2393-8056">Rohit Goswami</a> (or HaoZeke, or rg0swami), and well, if you
need to know more about why you might want to use my work, check my <a href="https://rgoswami.me">site</a>, or any of the <a href="https://keybase.io/HaoZeke">other sites</a> I manage, or even <a href="https://publons.com/researcher/2911170/rohit-goswami/">my publications</a> or <a href="https://github.com/HaoZeke">my code</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-org79f9114" class="outline-2">
<h2 id="org79f9114"><span class="section-number-2">3.</span> How?</h2>
<div class="outline-text-2" id="text-3">
<p>
Well it just goes where <code>doom</code> expects config files.
</p>
<div class="org-src-container">
<pre class="src src-bash"><code><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Honestly, this should be $HOME/.config
</span>git clone git@github.com:HaoZeke/dotdoom $<span style="font-weight: bold; font-style: italic;">HOME</span>/.config/doom
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org3d4b0a0" class="outline-2">
<h2 id="org3d4b0a0"><span class="section-number-2">4.</span> Maintenance</h2>
<div class="outline-text-2" id="text-4">
<p>
The canonical configuration sources are <a href="config.html">config.org</a> and <a href="packages.html">packages.org</a>.
Run <code>scripts/tangle-doom-config</code> after editing them; it regenerates the ignored
<code>config.el</code> and the tracked <code>packages.el</code> from those Org sources.
</p>

<p>
Local helper modules live under <code>local/rg-*.el</code> with matching ERT tests. The
encrypted <code>local/private.el.gpg</code> holds host-local paths and private custom state.
</p>

<p>
The <code>docs/</code> directory is the tracked static site output for this repo; keep
<code>docs/CNAME</code> and <code>docs/keybase.txt</code> with it. The <code>reveal/rjs/</code> tree is vendored
reveal.js for Org reveal exports, and <code>reveal/extras/</code> contains local
presentation CSS.
</p>
</div>
</div>
<div id="outline-container-org1f83550" class="outline-2">
<h2 id="org1f83550"><span class="section-number-2">5.</span> Config</h2>
<div class="outline-text-2" id="text-5">
<p>
Doom reads <code>init.el</code>, the generated <code>config.el</code>, and the tracked <code>packages.el</code>.
The maintained commentary lives in <a href="config.html">config.org</a> and <a href="packages.html">packages.org</a>.
</p>
</div>
</div>
<div id="outline-container-orga2893bd" class="outline-2">
<h2 id="orga2893bd"><span class="section-number-2">6.</span> License</h2>
<div class="outline-text-2" id="text-6">
<p>
It is a personal configuration. So I guess the <a href="https://choosealicense.com/licenses/mit/">MIT license</a> will do for now.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020:04:09</p>
<p class="author">Author: Rohit Goswami</p>
<p class="date">Created: 2026-06-12 Fri 21:41</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
